export interface Station {
  id: string;
  name: {
    he: string;
    en: string;
    ru: string;
    ar: string;
  };
}

export const stations: Station[] = [
  {
    id: '3700',
    name: {
      he: 'תל אביב - סבידור מרכז',
      en: 'Tel Aviv-Savidor Center',
      ru: 'Тель-Авив - Мерказ - Центральная',
      ar: 'تل ابيب – ساڤيدور المركز'
    }
  },
  {
    id: '3500',
    name: {
      he: 'הרצליה',
      en: 'Hertsliya',
      ru: 'Герцлия',
      ar: 'هرتسليا'
    }
  },
  {
    id: '3400',
    name: {
      he: 'בית יהושע',
      en: "Bet Yehoshu'a",
      ru: 'Бейт-Иегошуа ',
      ar: 'بيت يهوشوع'
    }
  },
  {
    id: '3300',
    name: {
      he: 'נתניה',
      en: 'Netanya',
      ru: 'Нетания',
      ar: 'نتانيا'
    }
  },
  {
    id: '3100',
    name: {
      he: 'חדרה - מערב',
      en: 'Hadera-West',
      ru: 'Хадера - Маарав',
      ar: 'الخضيرة - غرب  '
    }
  },
  {
    id: '2800',
    name: {
      he: 'בנימינה',
      en: 'Binyamina',
      ru: 'Биньямина',
      ar: 'بنيامينا'
    }
  },
  {
    id: '2820',
    name: {
      he: 'קיסריה - פרדס חנה',
      en: 'Caesarea-Pardes Hana',
      ru: 'Кейсария - Пардес-Хана',
      ar: 'قيساريا - بارديس حنا'
    }
  },
  {
    id: '2500',
    name: {
      he: 'עתלית',
      en: 'Atlit',
      ru: 'Атлит',
      ar: 'عتليت'
    }
  },
  {
    id: '2200',
    name: {
      he: 'חיפה - בת גלים',
      en: 'Haifa-Bat Galim',
      ru: 'Хайфа - Бат-Галим',
      ar: 'حيفا - بات چاليم'
    }
  },
  {
    id: '1300',
    name: {
      he: 'חוצות המפרץ',
      en: 'Hutsot HaMifrats',
      ru: 'Хоцот ха-Мифрац ',
      ar: 'حوتسوت همفراتس'
    }
  },
  {
    id: '700',
    name: {
      he: 'קריית חיים',
      en: 'Kiryat Hayim',
      ru: 'Кирьят-Хаим',
      ar: 'كريات حاييم'
    }
  },
  {
    id: '1400',
    name: {
      he: 'קריית מוצקין',
      en: 'Kiryat Motzkin',
      ru: 'Кирьят-Моцкин',
      ar: 'كريات موتسكين'
    }
  },
  {
    id: '1500',
    name: {
      he: 'עכו',
      en: 'Ako',
      ru: 'Акко ',
      ar: 'عكا'
    }
  },
  {
    id: '2300',
    name: {
      he: "חיפה - חוף הכרמל (ש' רזיאל)",
      en: 'Haifa-Hof HaKarmel (Razi`el)',
      ru: 'Хайфа Хоф ха-Кармель',
      ar: 'حيفا - شاطئ الكرمل'
    }
  },
  {
    id: '8700',
    name: {
      he: "כפר סבא - נורדאו (א' קוסטיוק)",
      en: 'Kfar Sava-Nordau (A.Kostyuk)',
      ru: 'Кфар-Саба – Нордау (А. Костюк)',
      ar: 'كفار سابا - نورداو'
    }
  },
  {
    id: '1600',
    name: {
      he: 'נהריה',
      en: 'Nahariya',
      ru: 'Нагария',
      ar: 'نهاريا'
    }
  },
  {
    id: '6500',
    name: {
      he: 'ירושלים - גן החיות התנכי',
      en: 'Jerusalem-Biblical Zoo',
      ru: 'Иерусалим – зоопарк',
      ar: 'القدس - حديقة الحيوان التوراتية'
    }
  },
  {
    id: '6300',
    name: {
      he: 'בית שמש',
      en: 'Bet Shemesh',
      ru: 'Бейт Шемеш',
      ar: 'بيت شيمش'
    }
  },
  {
    id: '7000',
    name: {
      he: 'קריית גת',
      en: 'Kiryat Gat',
      ru: 'Кирьят-Гат ',
      ar: 'كريات چات'
    }
  },
  {
    id: '5000',
    name: {
      he: 'לוד',
      en: 'Lod',
      ru: 'Лод',
      ar: 'اللد'
    }
  },
  {
    id: '7300',
    name: {
      he: 'באר שבע- צפון/אוניברסיטה',
      en: "Be'er Sheva-North/University",
      ru: 'Беер-Шева Цафон',
      ar: 'بئر السبع - شمال/الجامعة'
    }
  },
  {
    id: '4800',
    name: {
      he: 'כפר חב"ד',
      en: 'Kfar Habad',
      ru: 'Кфар ХАБАД',
      ar: 'كفار حباد'
    }
  },
  {
    id: '4600',
    name: {
      he: 'תל אביב - השלום',
      en: 'Tel Aviv-HaShalom',
      ru: 'Тель-Авив - ха-Шалом',
      ar: 'تل أبيب - السلام'
    }
  },
  {
    id: '2100',
    name: {
      he: 'חיפה- מרכז השמונה',
      en: 'Haifa Center-HaShmona',
      ru: 'Хайфа - Мерказ - Центральная',
      ar: 'حيفا المركز - هشمونا'
    }
  },
  {
    id: '5010',
    name: {
      he: 'רמלה',
      en: 'Ramla',
      ru: 'Рамле',
      ar: 'الرملة'
    }
  },
  {
    id: '8800',
    name: {
      he: 'ראש העין - צפון',
      en: "Rosh Ha'Ayin-North",
      ru: 'Рош ха-Айн Цафон',
      ar: 'روش هعاين - شمال'
    }
  },
  {
    id: '5300',
    name: {
      he: 'באר יעקב',
      en: "Be'er Ya'akov",
      ru: 'Беер-Яаков',
      ar: 'بئير يعكوف'
    }
  },
  {
    id: '5200',
    name: {
      he: "רחובות (א' הדר) ",
      en: 'Rehovot (E. Hadar)',
      ru: 'Реховот- им. А. Хадара',
      ar: 'رحوڤوت'
    }
  },
  {
    id: '5410',
    name: {
      he: 'יבנה מזרח',
      en: 'Yavne-East',
      ru: 'Явне-Восток',
      ar: 'ياڤنه - شرق'
    }
  },
  {
    id: '9100',
    name: {
      he: 'ראשון לציון - הראשונים',
      en: 'Rishon LeTsiyon-HaRishonim',
      ru: 'Ришон ле-Цион - Ха-Ришоним ',
      ar: 'ريشون لتسيون - هريشونيم'
    }
  },
  {
    id: '5800',
    name: {
      he: "אשדוד עד הלום (מ' בר כוכבא)",
      en: 'Ashdod-Ad Halom (M.Bar Kochva)',
      ru: 'Ашдод-ад-Халом (М. Бар Кохва)',
      ar: 'أشدود - عاد هلوم'
    }
  },
  {
    id: '4250',
    name: {
      he: 'פתח תקווה - סגולה',
      en: 'Petah Tikva-Segula',
      ru: 'Петах-Тиква - Сгула',
      ar: 'بيتح تكڤا - سچوله'
    }
  },
  {
    id: '4100',
    name: {
      he: 'בני ברק',
      en: 'Bnei Brak',
      ru: 'Бней-Брак',
      ar: 'بني براك'
    }
  },
  {
    id: '3600',
    name: {
      he: 'תל אביב - אוניברסיטה',
      en: 'Tel Aviv-University',
      ru: 'Тель-Авив - Университет',
      ar: 'تل أبيب - الجامعة'
    }
  },
  {
    id: '7320',
    name: {
      he: 'באר שבע - מרכז',
      en: "Be'er Sheva-Center",
      ru: 'Беер-Шева Мерказ',
      ar: 'بئر السبع - المركز'
    }
  },
  {
    id: '1220',
    name: {
      he: 'מרכזית המפרץ (לב המפרץ)',
      en: 'HaMifrats Central Station',
      ru: 'Центральная станция Ха-Мифрац',
      ar: 'همفراتس المركزية'
    }
  },
  {
    id: '4900',
    name: {
      he: 'תל אביב - ההגנה',
      en: 'Tel Aviv-HaHagana',
      ru: 'Тель-Авив - ха-Хагана ',
      ar: 'تل أبيب - ههچناه'
    }
  },
  {
    id: '8600',
    name: {
      he: 'נמל תעופה בן גוריון',
      en: 'Ben Gurion Airport',
      ru: 'Бен-Гурион Аэропорт',
      ar: 'مطار بن چوريون'
    }
  },
  {
    id: '6700',
    name: {
      he: 'ירושלים - מלחה',
      en: 'Jerusalem-Malha',
      ru: 'Иерусалим - Малха',
      ar: 'القدس - المالحه'
    }
  },
  {
    id: '5900',
    name: {
      he: 'אשקלון',
      en: 'Ashkelon',
      ru: 'Ашкелон ',
      ar: 'أشكلون'
    }
  },
  {
    id: '7500',
    name: {
      he: 'דימונה',
      en: 'Dimona',
      ru: 'Димона',
      ar: 'ديمونا'
    }
  },
  {
    id: '9200',
    name: {
      he: 'הוד השרון - סוקולוב',
      en: 'Hod HaSharon-Sokolov',
      ru: 'Ход Хашарон - Соколов',
      ar: 'هود هشارون - سوكولوڤ'
    }
  },
  {
    id: '4170',
    name: {
      he: 'פתח תקווה  - קריית אריה',
      en: 'Petah Tikva-Kiryat Arye',
      ru: 'Петах Тиква – Кирьят Арье',
      ar: 'بيتح تكڤا - كريات أريه'
    }
  },
  {
    id: '5150',
    name: {
      he: 'לוד גני אביב',
      en: 'Lod-Gane Aviv',
      ru: 'Лод - Ганей Авив',
      ar: 'اللد - چاني أڤيڤ'
    }
  },
  {
    id: '8550',
    name: {
      he: 'להבים - רהט',
      en: 'Lehavim-Rahat',
      ru: 'Леавим - Рахат',
      ar: 'لهاڤيم - رهط'
    }
  },
  {
    id: '300',
    name: {
      he: 'פאתי מודיעין',
      en: "Pa'ate Modi'in",
      ru: 'Патей Модиин',
      ar: 'بأتي موديعين'
    }
  },
  {
    id: '400',
    name: {
      he: 'מודיעין - מרכז',
      en: "Modi'in-Center",
      ru: 'Модиин центр ',
      ar: 'موديعين - المركز'
    }
  },
  {
    id: '4640',
    name: {
      he: 'צומת חולון',
      en: 'Holon Junction',
      ru: 'Холон - Развязка Холон',
      ar: 'مفترق حولون'
    }
  },
  {
    id: '4660',
    name: {
      he: 'חולון - וולפסון',
      en: 'Holon-Wolfson',
      ru: 'Холон - Вольфсон',
      ar: 'حولون - ڤولفسون'
    }
  },
  {
    id: '4680',
    name: {
      he: 'בת ים - יוספטל',
      en: 'Bat Yam-Yoseftal',
      ru: 'Бат Ям - Йосеф Таль',
      ar: 'بات يام - يوسفطال'
    }
  },
  {
    id: '4690',
    name: {
      he: 'בת ים - קוממיות',
      en: 'Bat Yam-Komemiyut',
      ru: 'Бат Ям - Комемуют',
      ar: 'بات يام - كوميميوت'
    }
  },
  {
    id: '9800',
    name: {
      he: 'ראשון לציון-משה דיין',
      en: 'Rishon LeTsiyon-Moshe Dayan',
      ru: 'Ришон-Ле-Цион станция им. Моше Даяна',
      ar: 'ريشون لتسيون -موشي ديان'
    }
  },
  {
    id: '9000',
    name: {
      he: 'יבנה מערב',
      en: 'Yavne-West',
      ru: 'Явне-Запад',
      ar: 'ياڤني - غرب'
    }
  },
  {
    id: '9600',
    name: {
      he: 'שדרות',
      en: 'Sderot',
      ru: 'Сдерот',
      ar: 'سديروت'
    }
  },
  {
    id: '9650',
    name: {
      he: 'נתיבות',
      en: 'Netivot',
      ru: 'Нетивот',
      ar: 'نتيفوت'
    }
  },
  {
    id: '9700',
    name: {
      he: 'אופקים',
      en: 'Ofakim',
      ru: 'Офаким',
      ar: 'أوفاكيم'
    }
  },
  {
    id: '3310',
    name: {
      he: 'נתניה - ספיר',
      en: 'Netanya-Sapir',
      ru: 'Нетания – Сапир',
      ar: 'نتانيا - سبير'
    }
  },
  {
    id: '1240',
    name: {
      he: 'יקנעם - כפר יהושע',
      en: "Yokne'am-Kfar Yehoshu'a",
      ru: 'Йокнеам – Кфар-Иегошуа',
      ar: 'يوكنعام – كفار يهوشوع'
    }
  },
  {
    id: '1250',
    name: {
      he: 'מגדל העמק - כפר ברוך',
      en: "Migdal Ha'emek-Kfar Barukh",
      ru: 'Мигдаль-Ха-Эмек – Кфар Барух',
      ar: 'مجدال هعيمك – كفار باروخ'
    }
  },
  {
    id: '1260',
    name: {
      he: 'עפולה ר.איתן',
      en: 'Afula R.Eitan',
      ru: 'Афула Р. Эйтан',
      ar: 'العفولة  ر. ايتان'
    }
  },
  {
    id: '1280',
    name: {
      he: 'בית שאן',
      en: "Beit She'an",
      ru: 'Бейт Шеан',
      ar: 'بيت شآن'
    }
  },
  {
    id: '1820',
    name: {
      he: 'אחיהוד',
      en: 'Ahihud',
      ru: 'Ахихуд',
      ar: 'احيهود'
    }
  },
  {
    id: '1840',
    name: {
      he: 'כרמיאל',
      en: 'Karmiel',
      ru: 'Кармиэль',
      ar: 'كرميئيل'
    }
  },
  {
    id: '2940',
    name: {
      he: 'רעננה מערב',
      en: "Ra'anana West",
      ru: 'Раанана-Вест',
      ar: 'رعنانا ويست'
    }
  },
  {
    id: '2960',
    name: {
      he: 'רעננה דרום',
      en: "Ra'anana South",
      ru: 'Раанана Южный',
      ar: 'رعنانا الجنوبية'
    }
  },
  {
    id: '6150',
    name: {
      he: 'קרית מלאכי - יואב',
      en: 'Kiryat Malakhi – Yoav',
      ru: 'Кирьят Малахи-Йоав',
      ar: 'كريات ملاخي – يوآڤ'
    }
  },
  {
    id: '680',
    name: {
      he: 'ירושלים - יצחק נבון',
      en: 'Jerusalem - Yitzhak Navon',
      ru: 'Иерусалим - Ицхак Навон',
      ar: 'أورشليم – يتسحاق ناڤون'
    }
  },
  {
    id: '6900',
    name: {
      he: 'מזכרת בתיה',
      en: 'Mazkeret Batya',
      ru: 'Мазкерет Батья',
      ar: 'مزكيرت باتيا'
    }
  }
]
